__author__ = 'Тризна Марина Евгеньевна'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

p = 159465489
s = str(p)
m = int(s[0])
for i in range(len(s) - 1):
    t = int(s[i + 1])
    if t > m:
        m = t
print('Наибольшое число =', m)


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

p = input ('Введите переменную p ')
p = int (p)
b = input ('Введите переменную b ')
b = int (b)
p = p + b
b = p - b
p = p - b
print ('p =', p)
print ('b=', b)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax? + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

a = input ('Введите первый коэффицент ')
a = int (a)
b = input ('Введите второй коэффицент ')
b = int (b)
c = input ('Введите третий коэффицент ')
c = int (c)
if (b ** 2 - 4 * a * c)> 0:
    import math 
    y = (-b + math.sqrt (b**2 - 4*a*c)) / 2
   
    x = (-b - math.sqrt (b**2 - 4*a*c)) / 2
    print ('Уравнение имеет два корня равных ', int(x), 'и ',int(y))
elif (b ** 2 - 4 * a * c) < 0:
    print ('Корней нет')
else:
    x = (-b) // 2*a
    print ('Уравнение имеет один корень равный ', int(x))